[
  {
    "name": "John L.",
    "location": "Texas, USA",
    "review": "Both my kids studied abroad and also we have vacationed there. We used the services that were suggested by the schools and they were EXPENSIVE with hidden fees for calls! This was the best website/service that I found through a google search. I bought a 4 band unlocked phone which is mine to keep forever with an International SIM card. I put on $100 and its good for 10 months. Then, you just talk until the balance is zero. You can recharge your SIM card easily with a credit card either online or with the phone itself. The website is easy to use. You can keep up with your account easily. I know there are many services like this, but this one is great, easy, dependable, honest, and no hidden fees. A mistake not to use them next time you travel. Much cheaper then using an international calling plan through your US carrier (eg. ATT, Verizon, Sprint). Their customer support is also excellent. This is the service to go with"
  },
  {
    "name": "Colleen B.",
    "location": "California, USA",
    "review": "I just wanted to tell you how great it was to travel with OneSimCard. We had to be in the UK, Ireland, Poland, Greece, Cyprus and South Korea. It worked so well everywhere - NO problems! Thanks"
  },
  {
    "name": "Ernie C.",
    "location": "Ontario, Canada",
    "review": "Amazing personalized service. I used to be with a competitor and I won't be going back, as OneSimCard is a better deal and with better service."
  },
  {
    "name": "Carissa B.",
    "location": "Massachusetts, USA",
    "review": "I just received the global SIM card I ordered a couple days ago. Due to my lack of familiarity with using the international cell phone I bought to be used with the SIM card, I encountered errors making test calls and text messages. When I called OneSimCard's customer service number, they patiently tested the functions with me. Not only were they prompt about shipping the SIM card, they deliver excellent customer service and support. Furthermore, I have not seen any hidden charges. I strongly recommend anyone needing a global SIM card to use OneSimCard."
  },
  {
    "name": "Nader S",
    "location": "Singapore",
    "review": "Been traveling around Europe and Middle East with the lowest rate I have ever paid. Most of the places I have visited have free incoming calls. Wahoo that's fantastic!"
  },
  {
    "name": "Bill B.",
    "location": "Massachusetts, USA",
    "review": "I am really impressed with OneSimCard cell phone service. I used it with my old unlocked Motorola V3 phone in 4 countries - Italy, France, China and Hong Kong. It worked everywhere without a glitch and saved me at least $400 in two weeks that I was traveling abroad."
  },
  {
    "name": "Don S",
    "location": "West Virginia, USA",
    "review": "I found OneSimCard to be most reliable and economical. I plan on using OneSimCard frequently and I just wish I had discovered them sooner."
  }
]
